; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-2-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p1-4 - location
	p2-0 - location
	p2-3 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	p3-5 - location
	p4-0 - location
	p5-0 - location
	p5-3 - location
	p5-4 - location
	p5-6 - location
	p6-4 - location
	)
	(:init
	(at driver1 s2)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at package1 s4)
	(at package2 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s5)
	(link s5 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s3)
	(link s3 s4)
	(link s6 s1)
	(link s1 s6)
	(link s6 s3)
	(link s3 s6)
	(link s6 s4)
	(link s4 s6)
)
	(:goal (and
	(at driver1 s6)
	(at truck2 s4)
	(at package1 s0)
	(at package2 s6)
	))


)

; plan
1. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   goals met: 0 of 4
2. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   goals met: 0 of 4
3. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   goals met: 0 of 4
4. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   goals met: 0 of 4
5. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 0 of 4
6. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 0 of 4
7. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 1 of 4
8. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   goals met: 1 of 4
9. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 0 of 4
10. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 0 of 4
11. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   goals met: 1 of 4
12. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 1 of 4
13. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   goals met: 1 of 4
14. (drive-truck truck2 s3 s6 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   goals met: 1 of 4
15. (unload-truck package2 truck2 s6)
   deleted: (in package2 truck2)
   added: (at package2 s6)
   goals met: 2 of 4
16. (drive-truck truck2 s6 s4 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 3 of 4
17. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 3 of 4
18. (walk driver1 s4 p6-4)
   deleted: (at driver1 s4)
   added: (at driver1 p6-4)
   goals met: 3 of 4
19. (walk driver1 p6-4 s6)
   deleted: (at driver1 p6-4)
   added: (at driver1 s6)
   goals met: 4 of 4
